src/src/InformationRegisters/AccountingPolicy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>AccountingPolicy</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>RegisteredForVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PostVATEntriesBySourceDocuments</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PostAdvancePaymentsBySourceDocuments</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ObsoleteUseTaxInvoices</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueAutomaticallyAgainstSales</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DefaultVATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATThreshold</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CashMethodOfAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InventoryValuationMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryValuationMethods</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseGoodsReturnFromCustomer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseGoodsReturnToSupplier</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/InformationRegisters/AccountingPolicy/Ext/RecordSetModule.bsl
Procedure OnWrite(Cancel, Replacing)
	
	SetPrivilegedMode(True);
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	MAX(AccountingPolicy.RegisteredForVAT) AS RegisteredForVAT,
		|	MAX(NOT AccountingPolicy.PostVATEntriesBySourceDocuments) AS PostVATEntriesBySourceDocuments,
		|	MAX(NOT AccountingPolicy.PostAdvancePaymentsBySourceDocuments) AS PostAdvancePaymentsBySourceDocuments,
		|	MAX(AccountingPolicy.UseGoodsReturnFromCustomer) AS UseGoodsReturnFromCustomer,
		|	MAX(AccountingPolicy.UseGoodsReturnToSupplier) AS UseGoodsReturnToSupplier,
		|	FunctionalOptionUseVAT.Value AS CommonUseVAT,
		|	UseTaxInvoices.Value AS CommonUseTaxInvoice,
		|	FunctionalOptionUseGoodsReturnFromCustomer.Value AS CommonUseGoodsReturnFromCustomer,
		|	FunctionalOptionUseGoodsReturnToSupplier.Value AS CommonUseGoodsReturnToSupplier
		|FROM
		|	InformationRegister.AccountingPolicy AS AccountingPolicy
		|		LEFT JOIN Constant.FunctionalOptionUseVAT AS FunctionalOptionUseVAT
		|		ON (TRUE)
		|		LEFT JOIN Constant.UseTaxInvoices AS UseTaxInvoices
		|		ON (TRUE)
		|		LEFT JOIN Constant.UseGoodsReturnFromCustomer AS FunctionalOptionUseGoodsReturnFromCustomer
		|		ON (TRUE)
		|		LEFT JOIN Constant.UseGoodsReturnToSupplier AS FunctionalOptionUseGoodsReturnToSupplier
		|		ON (TRUE)
		|
		|GROUP BY
		|	FunctionalOptionUseVAT.Value,
		|	UseTaxInvoices.Value,
		|	FunctionalOptionUseGoodsReturnFromCustomer.Value,
		|	FunctionalOptionUseGoodsReturnToSupplier.Value";
	
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		
		RegisteredForVAT	= Selection.RegisteredForVAT;
		UseTaxInvoices		= Selection.PostVATEntriesBySourceDocuments OR Selection.PostAdvancePaymentsBySourceDocuments;
		
		UseGoodsReturnFromCustomer	= Selection.UseGoodsReturnFromCustomer;
		UseGoodsReturnToSupplier	= Selection.UseGoodsReturnToSupplier;
	Else
		
		RegisteredForVAT	= False;
		UseTaxInvoices		= False;
		
		UseGoodsReturnFromCustomer	= False;
		UseGoodsReturnToSupplier	= False;
	EndIf;
	
	If Selection.CommonUseGoodsReturnFromCustomer <> UseGoodsReturnFromCustomer Then
		Constants.UseGoodsReturnFromCustomer.Set(UseGoodsReturnFromCustomer);
	EndIf;
	
	If Selection.CommonUseGoodsReturnToSupplier <> UseGoodsReturnToSupplier Then
		Constants.UseGoodsReturnToSupplier.Set(UseGoodsReturnToSupplier);
	EndIf;
	
	If Selection.CommonUseVAT <> RegisteredForVAT Then
		Constants.FunctionalOptionUseVAT.Set(RegisteredForVAT);
	EndIf;
	
	If Selection.CommonUseTaxInvoice <> UseTaxInvoices Then
		Constants.UseTaxInvoices.Set(UseTaxInvoices);
	EndIf;
	
EndProcedure
